Repository: yanaFramework/yanaFramework
Catalog: trunk/plugins/sdk/languages/*/sdk.xlf
Languages: de

# sdk.title
source: Generate new {lang id="SDK.APP"}
de: Neue {lang id="SDK.APP"} generieren

# sdk.replace_files
source: overwrite existing files
de: vorhandene Dateien überschreiben

# sdk.step1
source: Preparation
de: Vorbereitung

# sdk.step1_1
source: enter {lang id="SDK.APP"} data
de: Angaben zur {lang id="SDK.APP"}

# sdk.step1_2
source: enter {lang id="SDK.AUTHOR"} data
de: Angaben zum {lang id="SDK.AUTHOR"}

# sdk.step1_3
source: enter additional data
de: sonstige Daten

# sdk.step2
source: Interface
de: Schnittstelle

# sdk.step2_2
source: add more actions
de: weitere Aktionen hinzufügen

# sdk.step2_3
source: manipulate interface
de: Schnittstelle nachbearbeiten

# sdk.step2_4
source: Interface overview
de: gesamte Schnittstelle

# sdk.step3
source: Database
de: Datenbank

# sdk.step3_2
source: choose {lang id="SDK.SOURCE"}
de: {lang id="SDK.SOURCE"} auswählen

# sdk.step4_1
source: SQL file to create installation routine
de: SQL-Quelldatei zum Erstellen einer Installationsroutine

# sdk.field4
source: email
de: Mailadresse

# sdk.field5
source: web site (for updates)
de: Homepage (für Updates)

# sdk.field6
source: execution priority
de: Priorität der Ausführung

# sdk.field7
source: application type
de: Typ der Anwendung

# sdk.field8
source: requires the plugin
de: benötigt das Plugin

# sdk.field9
source: belongs to package
de: gehört zu Paket

# sdk.source
source: source file
de: Quelldatei

# sdk.description
source: description
de: Beschreibung

# sdk.img
source: image
de: Grafik

# sdk.desc_id
source: unique, allowed characters
de: eindeutig, erlaubte Zeichen

# sdk.desc8
source: id of the extended application
de: ID-Kennung der Anwendung welche erweitert wird

# sdk.desc9
source: id of the corresponding package
de: ID-Kennung des Anwendungspakets

# sdk.complete
source: Complete
de: Fertigstellen

# sdk.app
source: application
de: Anwendung

# sdk.none
source: none
de: keines

# sdk.author
source: author
de: Autor

# sdk.js_0
source: You need to set a unique name for this action.
de: Sie müssen eine eindeutige Bezeichnung für diese Aktion festlegen.

# sdk.js_1
source: secured
de: abgesichert

# sdk.nav.1
source: previous
de: zurück

# sdk.nav.2
source: next
de: weiter

# sdk.field10.0
source: no template
de: keine Vorlage

# sdk.field10.1
source: database application
de: Datenbankanwendung

# sdk.field10.2
source: administration panel
de: Administrationsmenü

# sdk.field11.5.0
source: Group
de: Gruppe

# sdk.field11.5.1
source: Role
de: Rolle

# sdk.field12.0
source: Menu entry
de: Menüeintrag

# sdk.field12.1
source: Start menu
de: Startmenü

# sdk.field12.2
source: Setup menu
de: Konfigurationsmenü

# sdk.field11.6
source: add action
de: Aktion hinzufügen

# sdk.interface.0
source: name of action
de: Name der Aktion

# sdk.interface.1
source: type of action
de: Typ der Aktion

# sdk.interface.4
source: included page
de: eingebettete Seite

# sdk.interface.5
source: access restriction
de: Zugriffsbeschränkung

# sdk.interface.desc
source: to execute this action, the user needs to have at least the following security level
de: um diese Aktion auszuführen muss der Nutzer mind. folgende Sicherheitsstufe haben

# sdk.interface.list
source: List of actions added to the interface
de: Liste neu hinzugefügter Aktionen der Schnittstelle

# sdk.priority.lowest
source: lowest
de: niedrigste

# sdk.priority.low
source: low
de: niedrig

# sdk.priority.high
source: high
de: hoch

# sdk.priority.highest
source: highest
de: höchste

# help.2
source: This step is optional. The framework is able to create the necessary sql statements for the installation of your database automatically if you provide a schema file.<br />The source file needs to be a valid sql file, which has the suffix ".sql".
de: Dieser Schritt ist optional. Das Framework kann die SQL-Anweisungen für die Installation Ihrer Datenbank automatisch erzeugen, wenn Sie eine Schemadatei angegeben haben.<br />Die Quelldatei muss eine gültige SQL-Datei sein und die Dateiendung ".sql" besitzen.

# help.3
source: <b>suggested naming convention:</b><br />[application name]_[{lang id="SDK.INTERFACE.1"}]_[individual name]<br />This ensures the chosen action id is unique. On database application it might be handy to provide the name of the table in question as well.
de: <b>empfohlene Namenskonvention:</b><br />[Name der Anwendung]_[{lang id="SDK.INTERFACE.1"}]_[beliebige Bezeichnung]<br />Dadurch wird sichergestellt, dass der gewählte Name der Aktion eindeutig ist. Bei Datenbankanwendungen ist es außerdem sinnvoll, zusätzlich den Namen der Tabelle anzugeben, auf welche sich die Aktion bezieht.

# help.5
source: If you click the button "save changes", required templates, configuration- and PHP files of your plugin will be created automatically. Next, the system's list of registered plugins is updated. For security reasons the new plugin keeps inactive, until you activate it in the administrator's panel.
de: Wenn Sie auf die Schaltfläche "Änderungen speichern" klicken, werden Templates, Konfigurations- und PHP-Dateien des Plugins automatisch erstellt. Anschliessend wird die Liste der im System registrieren Plugins aktualisiert. Aus Sicherheitsgründen bleibt das neue Plugin deaktiviert, bis Sie es im Administrationsmenü aktivieren.

# help.6
source: The source file should be a valid schema file for a database with the suffix ".xml".
de: Die Quelldatei muss eine gültige Schemadatei für eine Datenbank sein und die Dateiendung ".xml" besitzen.

# help.7
source: The file needs to be a schema file with the file extension .xml. Other files are not allowed here.
de: Die Datei muss eine Schemadatei mit der Dateiendung .xml sein. Andere Dateien sind nicht erlaubt.

# help.8
source: The file needs to be a SQL file with the file extension .sql. Other files are not allowed here.
de: Die Datei muss eine SQL-Datei mit der Dateiendung .sql sein. Andere Dateien sind nicht erlaubt.
