Repository: yanaFramework/yanaFramework
Catalog: trunk/plugins/guestbook_admin/languages/*/guestbook.xlf
Languages: de

# program_title
source: Guestbook
de: Gästebuch

source: opinion about this web site
de: Bewertung der Seite

source: Location
de: Wohnort

source: Comment
de: Kommentar

source: Date/Time
de: Datum/Zeit

source: more details
de: mehr Details

source: Do you really want to delete this entry?
de: Soll dieser Eintrag wirklich gelöscht werden?

source: Required: please insert your name here
de: Pflichtfeld: Geben Sie hier bitte Ihren Namen an

source: Required: please insert your text here
de: Pflichtfeld: Geben Sie hier den Text ein

source: Click here to save your comment
de: Klicken Sie hier um Ihren Kommentar zu speichern

source: Edit entry
de: Beitrag bearbeiten

source: Delete entry
de: Beitrag löschen

source: Click here to delete the entry
de: Klicken Sie bitte hier um den Beitrag endgültig zu löschen

source: New Entry
de: Neuer Eintrag

source: Your Name
de: Ihr Name

source: this website is
de: diese Seite ist

source: you may enter zip code or name of your location here
de: hier können Sie den Namen oder Postleitzahl Ihres Wohnorts angeben

source: you may enter your mail address here
de: geben Sie bitte hier die Mailadresse an

source: you may enter your homepage's URL here (ignore http://)
de: in dieses Feld können Sie die Adresse Ihrer Homepage eintragen (ohne http://)

source: Here you may (in case you got one) enter an ID, which can be used by others to contact you via messenger programs
de: Hier können Sie (falls Sie haben) die ID eingeben, unter der Besucher Sie über Messenger-Programme erreichen können

source: Click here to save your entry to the guestbook
de: Klicken Sie hier um einen neuen Eintrag im Gästebuch zu speichern

source: Add a comment
de: Kommentar einfügen

# rate_0
source: rating
de: ich finde

# rate_1
source: very good
de: sehr gut

# rate_2
source: good
de: gut

# rate_3
source: average
de: durchschnittlich

# rate_4
source: bad
de: schlecht

# rate_5
source: very bad
de: sehr schlecht

# descr_comment
source: Enter comment
de: Kommentar einfügen

# title_comment
source: answer this entry (Webmaster only)
de: auf einen Beitrag antworten (nur Webmaster)

# title_update_comment
source: replace comment
de: Kommentar ersetzen

source: previous page
de: Seite zurück

# mail_subject
source: guestbook entry
de: Gästebucheintrag

# mail_1
source: Somebody left a message for you at your guestbook! The message reads:
de: Jemand hat Ihnen eine Nachricht in Ihrem Gästebuch hinterlassen! Die Nachricht lautet:

# rss_description
source: the 10 most recent guestbook entries
de: die 10 neuesten Gästebucheinträge
