Repository: yanaFramework/yanaFramework
Catalog: trunk/languages/*/admin.xlf
Languages: de, fr

# index_4
source: create new profile
de: neues Profil anlegen
fr: génère profilé

# index_5
source: enter ID
de: ID eingeben
fr: entre ID

# index_6
source: choose a file
de: Datei wählen
fr: choisis fichier

# index_7
source: settings
de: Einstellungen
fr: Paramètres

# index_8
source: Database
de: Datenbank
fr: base de données

# index_9
source: current profile
de: aktuelles Profil
fr: profilé d'actualité

# index_10
source: default settings
de: Basiseinstellung
fr: configuration standard

# index_11
source: change profile
de: Profil wechseln
fr: change profilé

# index_12
source: clear server-cache
de: Server-Cache leeren
fr: dégage cache

# index_13
source: Check for new version
de: Nach neuer Version suchen
fr: Recherche d'une nouvelle version

# index_14
source: You got the latest version
de: Sie haben die aktuellste Version

# index_15
source: A new version is available
de: Es ist eine neue Version verfügbar

# index_16
source: Click here to download
de: Klicken Sie hier für Download

# descr_admin
source: Edit basic settings for all profiles:<br /><i>Link to your application</i> <b>{$PHP_SELF}</b>
de: Basis-Einstellungen für alle Profile:<br /><i>Link zu diesem Profil</i> <b>{$PHP_SELF}</b>

# descr_mod
source: Edit settings for current profile "{$ID}":<br /><i>Link to your application</i> <b>{$PHP_SELF}?id={$ID}</b>
de: Einstellungen für Profil "{$ID}" verwalten:<br /><i>Link zu diesem Profil</i> <b>{$PHP_SELF}?id={$ID}</b>

# descr_create
source: Create a new profile id = "{$ID}":<br /><i>Link to your application</i> <b>{$PHP_SELF}?id={$ID}</b>
de: Ein neues Profil erstellen id = "{$ID}":<br /><i>Link zu diesem Profil</i> <b>{$PHP_SELF}?id={$ID}</b>

# database.0
source: database server host address (URL)
de: Adresse des Datenbankservers (URL)

# database.1
source: default "localhost"
de: meist "localhost"

# database.2
source: database server port
de: Port des Datenbankservers

# database.3
source: default "3306"
de: meist "3306"

# database.4
source: username for database
de: Nutzername für Datenbank

# database.5
source: password for database
de: Passwort für Datenbank

# database.6
source: prefix for database
de: Präfix der Datenbank

# database.7
source: leave blank if not needed
de: wenn nicht benötigt frei lassen

# database.8
source: database name
de: Name der Datenbank

# database.9
source: type of database
de: Typ der Datenbank

# database.10
source: use database
de: Datenbank benutzen

# database.11
source: Setup a connection to your database
de: Verbindung zur Datenbank herstellen

# database.12
source: install selected databases
de: markierte Datenbanken installieren

# database.13
source: The choosen databases should be used:
de: Die ausgewählten Datenbanken sollen verwendet werden:

# database.14
source: synchronize databases
de: Datenbanken synchronisieren

# database.15
source: create backup
de: Backup erstellen

# database.17
source: export structure
de: Struktur exportieren

# database.18
source: export data
de: Daten exportieren

# database.19
source: compress as GZip
de: als GZip komprimieren

# database.21
source: create tables automatically
de: Tabellen automatisch anlegen

# database.22
source: copy table rows
de: Datensätze kopieren

# admin.0
source: Next time start in:
de: Beim nächsten Mal starten im:

# admin.1
source: active skin-file
de: aktive Skindatei

# admin.2
source: available skins
de: installierbare Skins

# admin.3
source: basic mode
de: Anfängermodus
fr: mode débutant

# admin.4
source: expert mode
de: Expertenmodus
fr: mode expert

# admin.5
source: active file
de: aktive Datei

# admin.6
source: available files
de: verfügbare Dateien
fr: fichiers disponible

# admin.8
source: search for Updates
de: nach Updates suchen

# admin.9
source: Options
de: Konfiguration

# admin.10
source: reload plugin list
de: Liste neu laden
fr: actualiser liste

# admin.11
source: selected font
de: gewählte Schriftart
fr: caractère choisi

# admin.12
source: other fonts
de: weitere Schriftarten
fr: choisir caractère

# admin.13
source: switch to {lang id="ADMIN.3"}
de: zu Anfängermodus wechseln
fr: choisis {lang id="ADMIN.3"}

# admin.14
source: switch to {lang id="ADMIN.4"}
de: zu Expertenmodus wechseln
fr: choisis {lang id="ADMIN.4"}

# admin.15
source: show/hide help
de: Hilfe ein-/ausblenden
fr: afficher/cacher aide

# admin.16
source: show/hide options
de: Optionen ein-/ausblenden
fr: afficher/cacher options

# admin.17
source: save changes to disk
de: Änderungen speichern

# admin.18
source: This file is write-protected, changes may not be saved.
de: Diese Datei ist schreibgeschützt, speichern deaktiviert.

# admin.20
source: Disabling a plugin will remove options provided by it. Are you should you want to go on and save your new settings?
de: Durch das Entfernen von Plugins kann es passieren, dass damit verbundene Funktionen nicht mehr zur Verfügung stehen. Sind Sie sicher, dass Sie den Vorgang fortsetzen möchten?

# admin.21
source: name of plugin
de: Name des Plugins

# admin.22
source: on/off
de: an/aus
fr: marche/arrêt

# admin.23
source: this plugin is active
de: dieses Plugin ist aktiv

# admin.24
source: Installed skins
de: installierte Skins

# admin.25
source: name of skin
de: Name des Skins

# admin.26
source: this plugin is deactivated
de: dieses Plugin ist deaktiviert

# admin.27
source: installed language versions
de: installierte Sprachen

# admin.29
source: Look & Feel
de: Darstellungsoptionen

# admin.30
source: advanced settings
de: erweiterte Einstellungen

# admin.31
source: program setup
de: Programmsetup
fr: setup de software

# admin.32
source: name of language pack
de: Name des Sprachpakets

# admin.34
source: author's name
de: Name des Autors

# admin.35
source: contact
de: Kontakt

# admin.36
source: Description
de: Beschreibung

# admin.37
source: guestbook
de: Gästebuch
fr: livre d'or

# admin.38
source: edit basic settings
de: Basiseinstellungen festlegen
fr: modifier préréglage

# admin.39
source: IP-blocking
de: IP-Blockierung

# admin.40
source: block IPs
de: IPs blockieren

# admin.41
source: this plugin is activated by default and must not be switched off
de: dieses Plugin ist per Voreinstellung immer aktiviert und darf nicht abgeschaltet werden

# admin.42
source: search
de: Stichwortsuche
fr: recherche

# admin.43
source: any number of entries
de: beliebig viele Einträge

# admin.44
source: only 1 entry
de: nur 1 Eintrag

# admin.45
source: consecutive entries
de: Einträge nacheinander

# admin.46
source: automatically
de: automatisch

# admin.47
source: Saturday, January 01, 2005
de: Samstag, 1. Januar 2005

# admin.48
source: font families
de: Schriftartfamilien
fr: familiale des caractères

# admin.49
source: The name that you choose contained illegal symbols that might not be used. Please use Letters, Numbers or '_' only.
de: Der gewählte Name enthält Sonderzeichen. Diese können nicht verwendet werden. Bitte verwenden Sie ausschliesslich Buchstaben, Zahlen oder das Zeichen '_'.

# admin.50
source: allow each visitor
de: erlaube pro Person

# admin.51
source: on new entries
de: bei neuen Einträgen

# admin.53
source: page layout
de: Seitenlayout

# admin.54
source: headlines
de: Überschriften

# admin.55
source: text style
de: Textformat
fr: style de text

# admin.56
source: show how many entries per page
de: wie viele Einträge pro Seite anzeigen

# admin.57
source: appearance of dates and times
de: Darstellung von Datums- und Zeitangaben

# admin.58
source: spam protection
de: Spamschutz

# admin.59
source: time settings
de: Zeiteinstellungen

# admin.60
source: community settings
de: Community-Freigabe

# admin.61
source: data source
de: Datenquelle

# admin.62
source: show journal entries
de: Protokolleinträge anzeigen

# admin.63
source: use my default settings and go on
de: Defaulteinstellungen verwenden und fortfahren

# admin.64
source: show an error message and don't go on
de: Einen Fehler melden und nicht fortfahren

# admin.65
source: get data from
de: Daten verwenden von

# admin.66
source: load smileys from
de: Emoticons laden von

# admin.67
source: show per page
de: zeige pro Seite

# admin.68
source: Font family
de: Schriftart
fr: familiale des caractères

# admin.69
source: click here if you want to be notified by email if someone leaves an entry in your guestbook
de: klicken Sie hier, wenn Sie bei neuen Einträgen in Ihrem Gästebuch eine Mail erhalten möchten

# admin.70
source: enter your email address here
de: geben Sie hier bitte Ihre Mailadresse an

# admin.71
source: click here if you want to automatically send visitors an email to thank them for signing your guestbook
de: klicken Sie hier, wenn Besucher die eine Nachricht in Ihr Gästebuch schreiben eine Mail erhalten sollen um sich für den Eintrag zu bedanken

# admin.72
source: enter an email address you want to appear as sender when sending mails
de: geben Sie hier die Mailadresse an, die als Absender auf Ihren Mails erscheinen soll

# admin.73
source: activate
de: aktivieren

# admin.74
source: send mail to
de: Mail senden an

# admin.75
source: sender of this mail is
de: als Absender anzeigen

# admin.76
source: Background color
de: Hintergrundfarbe

# admin.77
source: Background image
de: Hintergrundbild (Grafik)

# admin.78
source: Logo (image)
de: Logo (Grafik)

# admin.79
source: Font size
de: Schriftgröße
fr: taille des caractères

# admin.80
source: Font color
de: Textfarbe
fr: couleur des caractères

# admin.81
source: edit entries
de: Einträge editieren

# admin.82
source: Journal
de: Protokollierung

# admin.83
source: You may choose, wether the program should use the journal to report important events, like errors or deletion of an entry. You may want to turn this feature off to conserve resources and increase performance.
de: Hier können Sie festlegen, ob das Programm wichtige Ereignisse, wie kritische Fehler, oder das Löschen von Einträgen speichern soll. Sie können das Protokoll deaktivieren um Ressourcen zu sparen.

# admin.84
source: Limit number of entries to
de: Begrenze Anzahl der Einträge auf

# admin.85
source: search engine
de: Stichwortsuche
fr: moteur de recherche

# admin.86
source: e-mail protocol
de: Protokoll zusenden
fr: protocole de transfert de messages

# help.1
source: With this option you may use multiple profiles with the same data. To do so enter the ID of the foreign profile, with which you want to share the data, here. If you do not require this option, you may leave the field blank. In this case, all data will be stored separately, which is the default behaviour. For your information: the default profile is named "default". Please note that changing this setting will NOT ex post affect previously added data.
de: Mit diesem Feld können Sie für mehrere Profile die gleichen Daten verwenden. Geben Sie dazu hier die ID des fremden Profils ein, aus welchem die Daten für das aktuelle Profil stammen sollen. Wenn Sie dieses Feld nicht benötigen, können Sie es frei lassen. In diesem Fall werden die Daten separat gespeichert, was dem voreingestellten Verhalten entspricht. Zu Ihrer Information: Das Default-Profil heißt "default". Beachten Sie bitte, dass bereits existierende Daten durch die Änderung dieser Option NICHT nachträglich verändert werden.

# help.2
source: You may set, wether you want to be notified via email when a visitors leaves an entry at your guestbook.
de: Legen Sie fest, ob Sie eine Mail erhalten wollen, sobald ein Besucher einen Eintrag hinterlässt.

# help.3
source: Here you may set an e-mail address that should be used as default sender, whenever an e-mail is send. It should be the address of an administrator or support. Note that some mail-servers may reject an e-mail if this address is not valid.
de: Hier können Sie eine E-Mailadresse angeben, welche als Standardabsender verwendet werden soll, wann immer eine Mail versandt wird. Es sollte sich um die Adresse eines Administrators oder des Supports handeln. Beachten Sie, dass einige Mailserver E-Mails zurückweisen können, falls die hier angegebene Adresse nicht korrekt ist.

# help.4
source: Visitors may navigate through the entries using "next" and "previous" keys. Here you may set how many entries will be shown on each page.
de: Besucher können mit "weiter" und "zurück" -Tasten durch Einträge navigieren. Hier können Sie festlegen wie viele Einträge pro Seite angezeigt werden sollen.

# help.5
source: Here you may set the Appearance of dates and times in the application. If supported by the visitor's browser, the appearance will be adapted automatically to your visitor's local language and timezone.
de: Hier können Sie das Aussehen von Datumsangaben verändern. Die Darstellung wird automatisch an das landestypische Format (AM/PM oder 24h) und die Zeitzone des Besuchers angepasst falls der verwendete Browser dies unterstützt.

# help.6
source: The system will try to create the tables belonging to the chosen databases on the dbms. Therefore it will try to import stored sql files, appropriate to the database and dbms you choose. In some uncommon cases this process may fail. E.g. if: connecting to the sql-server fails, there is no no sql file available for the choosen dbms, the provided sql files contains errors, another table with the same name already exists, the user does not have the appropriate rights to create the tables. In those cases the installation must be done by hand.
de: Das System wird versuchen, die zu den ausgewählten Datenbanken gehörenden Tabellen auf dem DBMS erzeugen. Zu diesem Zweck werden gespeicherte SQL Dateien importiert, passend zur gewählten Datenbank und dem gewählten DBMS. In seltenen Fällen kann dieser Prozess jedoch fehlschlagen. Z.Bsp. wenn: keine Verbindung zum DB-Server möglich ist, für das gewählte DBMS keine SQL-Datei gespeichert ist, die SQL-Datei fehlerhaft ist, eine andere Tabelle mit der gleichen Bezeichnung bereits existiert, der Nutzer nicht ausreichende Rechte zum Erzeugen der Tabellen besitzt. In diesen Fällen muss die Installation von Hand durchgeführt werden.

# help.7
source: How is the program supposed to react, if it is called with a nonexisting profile-id (parameter "index.php?id=xyz"); or in other words: with a profile, for which you have not set up yet.
de: Wie soll sich das Programm verhalten, wenn es mit einer falschen Profil-ID (Parameter "index.php?id=xyz") aufgerufen wird; Das heißt: mit einem Profil, für welches Sie noch keine Einstellungen angelegt haben?

# help.8
source: Here you may choose directories, where you want your files to be stored. Please make sure, you have the required permission set for the program to access these files or direcotries. Overwise your visitors may get an error message.
de: Hier können Sie die Verzeichnisse auswählen, in denen Ihre Dateien liegen sollen. Beachten Sie bitte, dass Sie über ausreichende Rechte für die hier angegebenen Verzeichnisse und Dateien verfügen müssen, sonst werden Ihre Gäste eine Fehlermeldung erhalten.

# help.9
source: Here you may choose the directory, where the program shall search for smileys. Please make sure, you have set permission to read from that directory for the program. Overwise your visitors may get an error message.
de: Hier können Sie angeben, in welchem Verzeichnis die Smilies für das Programm gespeichert sind. Beachten Sie bitte, dass Sie für dieses Verzeichnis Leserechte besitzen müssen, weil Sie sonst eine Fehlermeldung erhalten.

# help.10
source: You may have the content of the protocol emailed to you from time to time. This mail will be send to you automatically, as soon as the maximum number of entries for the protocol has been reached.
de: Sofern Sie das möchten, können Sie sich den Inhalt des Protokolls regelmässig per Mail zusenden lassen. Die Mail wird an die angegebene Mailadresse versandt, sobald das Protokoll die maximal erlaubte Anzahl an Einträgen erreicht hat.

# help.13
source: At this section you may set the look of your application. Please note, that settings for "logo" and "background" should be URL's to Images on the web. Colors should be enterd as hexadecimal values.
de: In diesem Abschnitt legen Sie das Aussehen Ihres Programms fest. Logo und Hintergrundbild sollten URLs zu Bilddateien sein. Die Farbwerte werden als Hexadezimalzahlen angegeben.

# help.14
source: To improve your protection against "flooding" and "spam", you may limit the number of consecutive entries a visitor may write to a certain number. After this maximum number is reached, the visitor must wait for someone else to respond, before being allowed to post another entry.
de: Um den Schutz vor "Flooding" und "Spam" zu verbessern, können Sie die Zahl der Beiträge die eine Person am Stück schreiben darf auf eine bestimmte Zahl begrenzen. Sobald die maximale Anzahl erreicht wurde, muss der Besucher warten, bis jemand geantwortet hat, bevor er neue Beiträge schreiben darf.

# help.15
source: If necessary you may enter your own pathnames for the program here. You may choose the directory where your smileys are stored, the skin and the language file you want to use.
de: Falls notwendig können Sie hier eigene Pfadangaben für das Programm festlegen. Zum Beispiel, in welchem Verzeichnis Sie Ihre Smilies speichern möchten, welche Skindatei Sie verwenden wollen und welche Sprachdatei geladen werden soll.

# help.16
source: This section let's you decide, which text files you want to use as templates for automatically generated email.
de: Dieser Abschnitt gibt an, welche Textdateien als Vorlagen (Templates) für automatisch erstellte Mails verwendet werden sollen.

# help.17
source: <span class="embtag_tag_c">(recommended setting for communities)</span><br />Use this setting if you have a community in which each user is to get its own profile-id and you don't want to set up each profile by hand.
de: <span class="embtag_tag_c">(empfohlene Einstellung für Online-Communities)</span><br />Wenn Sie eine Community haben und jeder Nutzer eine eigene Profil-ID bekommen soll, ohne dass Sie jedes Profil einzeln von Hand anlegen müssen, dann wählen Sie diese Option.

# help.18
source: <span class="embtag_tag_c">(recommended setting for standard sites)</span><br />Use this setting if you have a "standard" web site and want to use only those profiles which you set up by yourself.
de: <span class="embtag_tag_c">(empfohlene Einstellung für normale Webseiten)</span><br />Wenn Sie eine normale Webseite (keine Community) haben und nur die Profile verwenden wollen, die Sie auch selbst angelegt haben, dann wählen Sie diese Option.

# help.19
source: Here you can setup a connection to your database, install new databases and when switching to a database you may import your old entries from local text files.
de: Hier können Sie eine Verbindung zu Ihrer Datenbank herstellen, neue Datenbanken installieren und beim aktivieren der Datenbank die neue Datenbank mit den alten Einträgen aus der lokalen Textdatei synchronisieren.

# help.20
source: If you choose "use database" with the value "yes", all future entries will be stored in the database, rather than using text files. Otherwise entries will be stored in filesystem.
de: Wenn Sie bei "Datenbank benutzen" den Wert "ja" wählen, dann werden in Zukunft neue Einträge in der Datenbank gespeichert. Sonst werden Textdateien benutzt.

# help.21
source: Database server address in most cases is "localhost", thus this is uncommon, it may also be another.
de: Die Adresse des Datenbankservers ist in der Regel "localhost", kann aber in Ausnahmefällen eine andere sein.

# help.22
source: Port address of database server is by default "3306". In some uncommon cases it may be another. If you don't now it, try to leave this field blank. Only if this does'nt work, try to look it up in your server configuration or ask your provider or administrator.
de: Der Port des Datenbankservers ist per Default-Einstellung "3306". In seltenen Fällen wird ein anderer verwendet. Wenn Sie den Port nicht kennen, lassen Sie das Feld testweise leer. Falls das nicht funktioniert, schauen Sie notfalls in der Serverkonfiguration nach oder fragen Sie Ihren Anbieter bzw. Administrator.

# help.23
source: As a rule you get your user name and password when registering your account. Please note! Your database login is most often NOT the same as your FTP login. If you don't know it, ask your provider or administrator.
de: Nutzernamen und Passwort erhalten Sie meist automatisch bei der Anmeldung Ihres Webspace. Achtung! Der Datenbanklogin ist in der Regel NICHT identisch mit Ihrem FTP-Login. Sollten Sie den Nutzernamen/Passwort nicht kennen, fragen Sie Ihren Anbieter bzw. Administrator.

# help.24
source: A database prefix may be used, if you want to run several instances of the same program at a time on the same site and database server settings, without having these installations influencing each other. Please use extra prefix for each installation. If you don't need it, leave the field blank.
de: Der Datenbankpräfix erfüllt den Zweck, dass Sie das gleiche Programm auf dem gleichen Webspace und dem gleichen Datenbankserver mehrmals installieren können, ohne dass sich die verschiedenen Versionen gegenseitig beeinflussen. Verwenden Sie dabei für jede separate Installation einen anderen Präfix. Sollten Sie diese Option nicht benötigen, lassen Sie das Feld bitte leer.

# help.25
source: This synchronizes the entries in your text files with those in your database. The process does NOT delete or update any existing entries, but only create non-existing ones. Please be patient! This may take a few seconds. When operating on very big ammounts of data you may expirience a timeout before the process is completed. If this happens, redo this procedure multiple times until all data has been transfered.
de: Die Einträge in den Textdateien und der Datenbank werden miteinander abgeglichen. Bei diesem Vorgang werden KEINE Einträge gelöscht oder geändert, sondern lediglich neue hinzugefügt. Bitte haben Sie Geduld! Das Synchronisieren dauert einige Sekunden. Bei sehr großen Datenmengen kann es zu einem Timeout kommen. In diesem Fall wiederholen Sie die Prozedur mehrfach, bis alle Daten übertragen sind.

# help.26
source: The entries in the database are extracted, encoded as SQL file and provided for download.
de: Die Einträge in der Datenbank werden extrahiert, als SQL-Datei kodiert und zum Download bereit gestellt.

# index_1
source: administer homepage profiles
fr: administrer profiles d'homepage

# index_3
source: Administrator
fr: Administrateur
