Repository: yanaFramework/yanaFramework
Catalog: trunk/languages/*/antispam.xlf
Languages: de

# spam.0
source: level of protection
de: Sicherheitsstufe

# spam.1
source: user defined settings
de: benutzerdefinierte Einstellungen

# spam.2
source: Should a CAPTCHA be used?
de: Soll ein "CAPTCHA" verwendet werden?

# spam.3
source: Should known (logged in) users also be checked?
de: Sollen auch angemeldete Benutzer geprüft werden?

# spam.4
source: Should rejected entries (junk) be logged?
de: Sollen abgewiesene Einträge (Spam) protkolliert werden?

# spam.5
source: Should users be prevented from sending form data multiple times?
de: Soll das doppelte Absenden von Formularen verhindert werden?

# spam.6
source: Should header data send by the browser be included in checks?
de: Soll der vom Browser gesendete Header geprüft werden?

# spam.7
source: Should entries be checked for suspicious words?
de: Soll nach verdächtigen Wörtern durchsucht werden?

# spam.8
source: List of blocked words
de: Liste geblockter Wörter

# spam.9
source: Words, that may not be found
de: Wörter, welche nicht enthalten sein dürfen

# spam.10
source: Do you want to use regular expressions?
de: Möchten Sie reguläre Ausdrücke verwenden?

# spam.level.0
source: deactivated
de: deaktiviert

# spam.level.1
source: low
de: niedrig

# spam.level.2
source: medium
de: mittel

# spam.level.3
source: high
de: hoch

# spam.level.user
source: user defined
de: benutzerdefiniert

# spam.desc.captcha
source: Application of CAPTCHA is activated.
de: Die Verwendung von CAPTCHA ist aktiviert.

# spam.desc.nocaptcha
source: No CAPTCHA is used.
de: Es wird kein CAPTCHA verwendet.

# spam.desc.words
source: Words are filtered.
de: Wörter werden gefiltert.

# spam.desc.nowords
source: Words are not filtered.
de: Wörter werden nicht gefiltert.

# spam.desc.login
source: All users will be checked.
de: Es werden alle Benutzer geprüft.

# spam.desc.nologin
source: Only users, who are not logged in, will be checked.
de: Es werden nur Benutzer ohne Login geprüft.

# spam.desc.form
source: Preventing users from sending form data multiple times.
de: Doppeltes Absenden von Formularen wird unterbunden.

# spam.desc.none
source: The input is not checked.
de: Es wird keine Überprüfung der Nutzereingaben durchgeführt.

# spam.desc.user
source: This option enables you to choose individual settings.
de: Diese Option erlaubt Ihnen, individuelle Einstellungen vorzunehmen.

# help.1
source: This menu enables you to choose, if and by which filters the input, the visitor sends to the server, is automatically checked. This aims at the avoidance of unrequested ads and vandalism. If the user's input is suspicious, the process will automatically be aborted. A message will be generated for the visitor, to describe the error and an entry will be added to the system's logs, for you to review.
de: Dieses Menü erlaubt festzulegen, ob und auf welche Weise die Eingaben, welche der Benutzer an den Server sendet, automatisch geprüft werden. Dies dient dazu, unerwünschte Werbung und Vandalismus zu vermeiden. Sollten die Eingaben des Benutzers nicht akzeptiert werden, wird der Vorgang automatisch abgebrochen. Es wird eine Meldung für den Benutzer generiert, welche den Fehler beschreibt und es wird ein Eintrag im Protokoll des System angelegt, welchen Sie einsehen und prüfen können.

# help.2
source: This menu lets you choose a level of protection. These are meant to ease the configuration for you. Each level provides you with predefined settings. If you are not satisfied with these, you may choose the menu's option "user defined", to choose individual settings for all sections.
de: Dieses Menü erlaubt Ihnen eine Sicherheitsstufe auszuwählen. Diese sollen Ihnen die Konfiguration erleichtern. Jede Stufe bietet Ihnen vordefinierte Einstellungen. Sollten Sie mit diesen jedoch nicht zufrieden sein, können Sie den Menüpunkt "benutzerdefiniert" wählen, um individuelle Einstellungen für alle Bereiche vornehmen zu können.

# help.3
source: A "CAPTCHA" is an image, that shows numbers and letters, the user must type in a form field. While a human can read the image, most automated programs (bots) are not able to do this.
de: Ein "CAPTCHA" ist eine Grafik mit Zahlen und Buchstaben, welche der Benutzer abtippen muss. Während ein Mensch dies lesen kann, können automatische Programme (Bots) dies in der Regel nicht.

# help.4
source: If you choose "yes", input will always be checked. If you choose "no", only unknown visitors without a login will be checked.
de: Falls "ja" werden die Eingaben immer geprüft. Falls "nein" werden nur Gäste geprüft, die keinen eigenen Login besitzen.

# help.5
source: The logs can be found via the administration panel. This option is only available, if the system logs are activated.
de: Das Protokoll finden Sie über das Administrationsmenü. Dieser Optionspunkt steht nur zur Verfügung, wenn das Systemprotokoll aktiviert wurde.

# help.6
source: Prevents user from accidentally sending form data multiple times. Also a user may submit a form no earlier than 3 seconds after it has been opened. This provides good protection against unrequested ads through automated programs.
de: Verhindert, dass ein Benutzer ein Formular aus Versehen mehrmals abschickt. Außerdem kann ein gerade aufgerufenes Formular frühestens nach 3 Sekunden abgesendet werden. Diese Massnahme bietet einen guten Schutz vor unerwünschter Werbung durch automatische Programme.

# help.7
source: Checks the header data send by the browser for signatures of known bots.
de: Prüft den vom Browser gesendeten Header auf Angaben, bekannter Bots.

# help.8
source: Checks input for suspicious words, which may not be present. If any such word is found, the entry will not be added.
de: Durchsucht die Eingabedaten nach bestimmten Wörtern, welche diese nicht enthalten dürfen. Wird ein solches Wort gefunden, so wird der Eintrag nicht gespeichert.

# help.9
source: Experienced users may increase the efficiency of this filter, by providing words as regular expressions. For regular expressions a perl-compatible syntax is used.
de: Erfahrene Nutzer können die Effektivität dieses Filters erhöhen, indem Sie diese Wörter als reguläre Ausdrücke angeben. Für reguläre Ausdrücke wird die Perl-Syntax verwendet.
