Repository: yanaFramework/yanaFramework
Catalog: trunk/languages/*/db_tools.xlf
Languages: de

# db_tools.field1
source: SQL dialect
de: SQL-Dialekt

# db_tools.field2
source: export structure of following databases
de: exportiere Struktur folgender Datenbanken

# db_tools.field3
source: import from existing database
de: Import aus bestehender Datenbank

# db_tools.field4
source: import from MDB2 Schema
de: Import aus MDB2 Schema

# db_tools.field5
source: XML file
de: XML-Datei

# db_tools.field6
source: import from DB Designer 4
de: Import aus DB Designer 4

# db_tools.field7
source: export data of following databases
de: exportiere Daten folgender Datenbanken

# db_tools.import
source: Create structure file from existing database
de: Strukturdatei aus vorhandener Datenbank erzeugen

# db_tools.exportsql
source: Export database structure to SQL
de: Export der Datenbankstruktur nach SQL

# db_tools.exportxml
source: Export database contents to XML
de: Export der Datenbankinhalte nach XML

# help.1
source: Click on the button "submit". The generated file will be send to your browser as a download. Structure files may for example be used as input for the Yana SDK.
de: Klicken Sie auf die Schaltfläche "Abschicken". Die generierte Datei wird Ihnen automatisch zum Download bereitgestellt. Strukturdateien können z.Bsp. als Eingabe für das Yana SDK verwendet werden.

# help.2
source: This exports the structure of a database to a SQL file. Choose the SQL dialect that corresponds with the type of server you use and click on the button "submit". The generated SQL file will be send to your browser as a download.
de: Diese Funktion exportiert die Struktur einer Datenbank in eine SQL-Datei. Wählen Sie den SQL-Dialekt aus, welcher Ihrem Datenbankserver entspricht und klicken Sie auf die Schaltfläche 'Abschicken'. Die generierte SQL-Datei wird Ihnen automatisch zum Download bereitgestellt.

# help.3
source: This option is available for the following DBMS: MySQL, MS-SQL, FrontBase, PostgreSQL. It is recommended to edit the file in a text editor, to add changes that you might feel necessary (e.g. provide easy-to-read names for your columns). Please note when editing: the file is case sensitive.
de: Diese Option steht für folgende DBMS zur Verfügung: MySQL, MS-SQL, FrontBase, PostgreSQL. Es ist empfehlenswert die generierte Datei mit einem Texteditor zu editieren, um eventuelle Ergänzungen vorzunehmen (z.Bsp. Tabellenspalten leicht verständliche Namen zuordnen). Beim Editieren beachten Sie bitte, dass die erzeugte Datei zwischen Groß- und Kleinschreibung unterscheidet. Eine Anleitung finden Sie im Kochbuch für Entwickler im Abschnitt Datenbanken, sowie im den Handbuch beiliegenden Tutorial.

# help.4
source: This option enables you to import a database structure from a PEAR MDB2 Schema XML file.
de: Diese Option gestattet es Ihnen, eine vorhandene Datenbankstruktur aus PEAR MDB2 Schema XML-Datei zu importieren.

# help.5
source: This option enables you to import a database structure from a DB Designer 4 XML file.
de: Diese Option gestattet es Ihnen, eine vorhandene Datenbankstruktur aus einer DB Designer 4 XML-Datei zu importieren.

# help.6
source: This exports the data of a database to a XML file. The generated file will be send to your browser as a download.
de: Diese Funktion exportiert die Daten einer Datenbank in eine XML-Datei. Die generierte Datei wird Ihnen automatisch zum Download bereitgestellt.
