Repository: yanaFramework/yanaFramework
Catalog: trunk/languages/*/message.xlf
Languages: de

# YanaCoreExceptionsMessagesSuccessMessage.h
source: Your changes have been saved.
de: Änderungen wurden gespeichert.

# YanaCoreExceptionsSecurityLoginRequiredException.h
source: Password required.
de: Passwort erforderlich.

# YanaCoreExceptionsSecurityLoginRequiredException.p
source: You are entering a protected area. Please enter your user name and password to proceed.
de: Sie betreten einen geschützten Bereich. Bitte geben Sie Ihren Nutzernamen und Passwort ein, um sich anzumelden.

# YanaCoreExceptionsSecurityLowPasswordQualityException.h
source: Password quality is too low.
de: Passwort qualität is zu niedrig.

# YanaCoreExceptionsSecurityLowPasswordQualityException.p
source: Required action can not be saved. Please use for you password numbers and special characters.
de: Die gewünschte Aktion konnte nicht gespeichert werden. Bitte verwenden Sie zahlen und sonderzeichen für Ihr passwort.

# YanaCoreExceptionsSecurityInsufficientRightsException.h
source: Permission denied.
de: Zugriff verweigert.

# YanaCoreExceptionsSecurityInsufficientRightsException.p
source: Your login is correct, but the requested action is not available, since you got insufficient permission for this section. Please check your URL. If you feel this is an error and want your settings checked, please inform your administrator.
de: Ihr Login ist korrekt, aber die gewünschte Aktion ist nicht verfügbar weil Ihre Zugriffsrechte nicht ausreichend sind. Bitte prüfen Sie gegebenenfalls, ob die gewählte URL korrekt ist. Falls Sie Ihre Zugriffsrechte aktualisieren lassen wollen, wenden Sie sich bitte an Ihren Administrator.

# YanaCoreExceptionsFilesInvalidImageException.h
source: The file {$FILE} is not a valid image.
de: Die Datei {$FILE} ist keine gültige Grafik.

# YanaCoreExceptionsFilesInvalidTypeException.h
source: The file {$FILE} has the wrong type: {$TYPE} expected.
de: Die Datei {$FILE} hat den falschen Typ: {$TYPE} erwartet.

# YanaCoreExceptionsFilesUploadFailedException.h
source: The file {$FILE} could not be saved.
de: Die Datei {$FILE} konnte nicht gespeichert werden.

# YanaCoreExceptionsFilesSizeException.h
source: Input is not valid.
de: Eingabe ist ungültig.

# YanaCoreExceptionsFilesSizeException.p
source: The file {$FILE} is too large. It must not exceed a maximum size of {$MAXIMUM} byte.
de: Die Datei {$FILE} ist zu groß. Sie darf nicht größer sein als {$MAXIMUM} byte.

# YanaCoreExceptionsInvalidActionException.h
source: Page not found.
de: Seite nicht gefunden.

# YanaCoreExceptionsInvalidActionException.p
source: The action '{$ACTION}' is undefined, operation aborted.<br /><noscript>Note to IE users: there exists a known issue with nonstandard compliant handling of the HTML "button" tag in some IE versions. This software has a JavaScript work-around for this problem. Activate JavaScript and try again.</noscript>
de: Die Aktion '{$ACTION}' ist undefiniert, Operation abgebrochen.<br /><noscript>Hinweis an IE-Nutzer: In einigen IE-Versionen gibt es ein bekanntes Problem mit einer nicht standardkonformen Verarbeitung des HTML "button" tags. Diese Software besitzt einen JavaScript-Workaround für das Problem. Aktivieren Sie JavaScript und versuchen Sie es erneut.</noscript>

# YanaCoreExceptionsSecurityInvalidLoginException.h
source: Access denied.
de: Zugriff verweigert.

# YanaCoreExceptionsSecurityInvalidLoginException.p
source: The given user name and/or password is incorrect. Please check the text you entered and try again.
de: Der eingegebene Nutzername und/oder Passwort sind leider nicht korrekt. Bitte prüfen Sie Ihre Eingabe und versuchen Sie es erneut.

# YanaCoreExceptionsMessagesLoginMessage.h
source: Access granted.
de: Zugriff gewährt.

# YanaCoreExceptionsMessagesLoginMessage.p
source: Welcome!
de: Herzlich Willkommen

# YanaCoreExceptionsMessagesLogoutMessage.h
source: You have been logged out.
de: Sie wurden erfolgreich abgemeldet.

# YanaCoreExceptionsMessagesLogoutMessage.p
source: Have a nice day!
de: Vielen Dank für Ihren Besuch!

# YanaCoreExceptionsFormsAlreadySavedException.h
source: Your entry has already been saved.
de: Dieser Eintrag wurde bereits gespeichert.

# YanaCoreExceptionsFormsAlreadySavedException.p
source: Please remember to submit your entries only once.
de: Bitte achten Sie darauf Beiträge nicht mehrmals abzusenden.

# YanaCoreExceptionsFormsFloodException.h
source: Your entry has already been saved.
de: Ihr Beitrag wurde bereits gespeichert.

# YanaCoreExceptionsFormsFloodException.p
source: No additional entries allowed this time.<br />Please give me and other visitors some time to react on the entries you already made.
de: Weitere Einträge sind zur Zeit nicht erlaubt.<br />Bitte geben Sie mir und anderen Besuchern etwas Zeit, auf Ihren Eintrag zu reagieren.

# YanaCoreExceptionsFilesNotFoundException.h
source: The requested file or directory was not found.
de: Die gewünschte Datei oder Verzeichnis ist nicht vorhanden.

# YanaCoreExceptionsFilesNotFoundException.p
source: Please check your input and try again.
de: Bitte überprüfen Sie Ihre Eingabe und versuchen Sie es erneut.

# YanaCoreExceptionsFormsInvalidCharacterException.h
source: A chosen parameter is not valid.
de: Eingabe ist ungültig.

# YanaCoreExceptionsFormsInvalidCharacterException.p
source: The value "{$VALUE}" at field "{$FIELD}" contains illegal characters. Allowed characters are: "{$VALID}".
de: Der Wert "{$VALUE}" im Feld "{$FIELD}" enthält ungültige Zeichen. Erlaubte Zeichen sind: "{$VALID}".

# YanaCoreExceptionsFormsInvalidSyntaxException.h
source: A chosen parameter is not valid.
de: Eingabe ist ungültig.

# YanaCoreExceptionsFormsInvalidSyntaxException.p
source: The value "{$VALUE}" at field "{$FIELD}" has an invalid format. Valid is: "{$VALID}".
de: Der Wert "{$VALUE}" im Feld "{$FIELD}" hat ein ungültiges Format. Gültig ist: "{$VALID}".

# YanaCoreExceptionsInvalidInputException.h
source: A chosen parameter is not valid.
de: Eingabe ist ungültig.

# YanaCoreExceptionsInvalidInputException.p
source: A parameter you have chosen is not valid. This is because you entered no or an incorrect value, or the link that brought you here does not work. For example, this may happen, if you chose to safe a file without giving a destination to safe the file to.<br />Try chosing another parameter setting. If you still keep getting this message, please inform the administrator.
de: Ein gewählter Parameter ist ungültig. Entweder wurde ein ungültiger bzw. gar kein Wert angegeben, oder der gewählte Link ist defekt. Dies kann zum Beispiel passieren, wenn eine Datei zum Speichern gewählt wurde, aber kein Dateiname angegeben wird.<br />Bitte wählen Sie eine andere Belegung für Ihre Parameter. Sollte dieser Fehler trotzdem weiterhin bestehen bleiben, wenden Sie sich an den Webmaster.

# YanaCoreExceptionsFormsMissingInputException.h
source: Input is invalid.
de: Eingabe ist ungültig.

# YanaCoreExceptionsFormsMissingInputException.p
source: Please fill in all required information before you submit the form.
de: Bitte füllen Sie alle erforderlichen Felder aus, bevor Sie einen Eintrag abschicken.

# YanaCoreExceptionsFormsMissingFieldException.h
source: Input is invalid.
de: Eingabe ist ungültig.

# YanaCoreExceptionsFormsMissingFieldException.p
source: The following mandatory information is missing: <b>{$FIELD}</b>
de: Die folgenden Pflichtangaben fehlen: <b>{$FIELD}</b>

# YanaCoreExceptionsFormsInvalidValueException.h
source: Your entry could not be saved.
de: Die Aktion konnte nicht durchgeführt werden.

# YanaCoreExceptionsFormsInvalidValueException.p
source: The following fields contain invalid input: <b>{$FIELD}</b>
de: Die folgenden Felder enthalten ungültige Werte: <b>{$FIELD}</b>

# YanaCoreExceptionsSecurityPermissionDeniedException.h
source: Permission denied.
de: Zugriff verweigert.

# YanaCoreExceptionsSecurityPermissionDeniedException.p
source: We are sorry: you don't have permission to perform the requested action.<br />If you feel this is an error, report this message to the administrator.
de: Sie haben keine ausreichenden Rechte die gewünschte Funktion aufzurufen.<br />Wenn Sie diese Sperre aufheben möchten, wenden Sie sich bitte an den Administrator.

# YanaCoreExceptionsAlreadyExistsException.h
source: Permission denied.
de: Zugriff verweigert.

# YanaCoreExceptionsAlreadyExistsException.p
source: Unable to create an entry with the id "{$ID}" because another entry with the same name already exists.
de: Es konnte kein neuer Eintrag mit der id "{$ID}" erzeugt werden, weil bereits ein anderer Eintrag mit diesem Namen existiert.

# YanaCoreExceptionsUserMissingNameException.h
source: User name missing
de: Nutzername fehlt

# YanaCoreExceptionsUserMissingNameException.p
source: Please make sure to provide a valid name and try again.
de: Bitte stellen Sie sicher, dass ein gültiger Name angegeben wird und versuchen Sie es erneut.

# YanaCoreExceptionsSecurityLowPasswordQualityException.h
source: Low password quality
de: Niedrige Passwortqualität

# YanaCoreExceptionsSecurityLowPasswordQualityException.p
source: The password you entered is too easy to guess. Please enter a more complex password and try again.
de: Das eingegebene Passwort ist zu leicht zu erraten. Bitte wählen Sie ein komplexeres Passwort und versuchen Sie es erneut.

# YanaCoreExceptionsSecurityPasswordUsedBeforeException.h
source: Password has already been used
de: Passwort wurde bereits verwendet

# YanaCoreExceptionsSecurityPasswordUsedBeforeException.p
source: The provided password is the same that you have used before. Please select another one.
de: Das eingegebene Passwort wurde zuvor bereits verwendet. Bitte wählen Sie ein anderes.

# YanaCoreExceptionsSecurityPasswordDoesNotMatchException.h
source: Password does not match
de: Passwort wurde bereits verwendet

# YanaCoreExceptionsSecurityPasswordDoesNotMatchException.p
source: The provided passwords don't match. Please try again.
de: Die eingegebenen Passwörter stimmen nicht überein. Bitte versuchen Sie es erneut.

# YanaCoreExceptionsUserNotFoundException.h
source: User unknown.
de: Nutzer unbekannt.

# YanaCoreExceptionsUserNotFoundException.p
source: Please check the name you provided and try again.
de: Bitte überprüfen Sie Ihre Eingabe und versuchen Sie es erneut.

# YanaCoreExceptionsNotFoundException.h
source: Entry not found.
de: Eintrag nicht gefunden.

# YanaCoreExceptionsNotFoundException.p
source: Please check the name or id you provided and try again.
de: Bitte korrigieren Sie Ihre Eingabe und versuchen Sie es erneut.

# YanaCoreExceptionsUserAlreadyExistsException.h
source: User already exists.
de: Nutzer existiert bereits.

# YanaCoreExceptionsUserAlreadyExistsException.p
source: Another user with the same user name already exists. Please choose another login and try again.
de: Ein anderer Nutzer mit dem selben Nutzernamen existiert bereits am System. Bitte wählen Sie einen anderen Namen und versuchen Sie es erneut.

# YanaCoreExceptionsUserDeleteSelfException.h
source: User is not allowed to delete it's own account.
de: Nutzer kann sich nicht selbst löschen.

# YanaCoreExceptionsUserDeleteSelfException.p
source: You have tried to delete the own user account. This action is prohibited for security reasons.
de: Sie haben versucht Ihr eigenes Nutzerkonto zu löschen. Diese Aktion ist aus Sicherheitsgründen nicht gestattet.

# YanaCoreExceptionsUserDeleteAdminException.h
source: Administrator is a protected account.
de: Systemadministrator ist ein geschütztes Konto.

# YanaCoreExceptionsUserDeleteAdminException.p
source: This account is protected and may not be deleted or deactivated for security reasons. Changes to this user's groups are prohibited.
de: Dieses Konto ist geschützt und darf aus Sicherheitsgründen nicht gelöscht, oder deaktiviert werden. Veränderungen der Nutzergruppe sind nicht gestattet.

# YanaCoreExceptionsSecurityLoginDeniedException.h
source: Login currently not possible.
de: Login vorübergehend nicht möglich.

# YanaCoreExceptionsSecurityLoginDeniedException.p
source: Because a wrong password has been entered more than 3 times, any login to this account is suspended for 5 minutes. Please wait to the end of this period and try again. If you forgot your password, please notify your administrator.
de: Das Passwort wurde mehr als 3 Mal falsch eingegeben. Der Login ist für 5 Minuten gesperrt. Bitte warten Sie diese Frist ab und versuchen Sie es dann erneut. Falls Sie Ihr Passwort vergessen haben sollten, benachrichtigen Sie Ihren Administrator.

# YanaCoreExceptionsFilesNotCreatedException.h
source: File could not be created
de: Datei konnte nicht erzeugt werden

# YanaCoreExceptionsFilesNotCreatedException.p
source: Unable to create file <b>{$FILE}</b>. Possible reason: access restriction in effect.
de: Die Datei <b>{$FILE}</b> konnte nicht erzeugt werden. Möglicherweise sind unzureichende Rechte gesetzt oder das Verzeichnis ist schreibgeschützt.

# YanaDbQueriesExceptionsNotCreatedException.h
source: The entry could not be created
de: Der Eintrag konnte nicht erzeugt werden

# YanaDbQueriesExceptionsNotCreatedException.p
source: Please check your input and try again. Possible reason: a required field has not been provided, a reference to another entry is not valid or the database may not be ready to accept your request.
de: Bitte prüfen Sie Ihre Eingaben und versuchen Sie es erneut. Möglicher Ursachen: ein notwendiges Feld ist nicht ausgefüllt, ein Verweis auf einen anderen Eintrag ist ungültig, oder die Datenbank ist derzeit nicht in der Lage Ihre Anfrage zu bearbeiten.

# YanaDbQueriesExceptionsNotDeletedException.h
source: The entry could not be deleted
de: Der Eintrag konnte nicht gelöscht werden

# YanaDbQueriesExceptionsNotDeletedException.p
source: The selection may either be invalid, the entry has already been removed, or it is still referenced by another entry and cannot be removed.
de: Die Auswahl könnte ungültig oder bereits gelöscht sein, oder ein anderer Eintrag verweist noch auf diesen, sodass ein Löschen derzeit nicht möglich ist.

# YanaCoreExceptionsFilesNotWriteableException.h
source: Data could not be saved
de: Daten konnten nicht gespeichert werden

# YanaCoreExceptionsFilesNotWriteableException.p
source: Unable to perform write operation on resource <b>{$FILE}</b>. Possible reason: access restriction in effect. Please inform administrator on this error.
de: Der Schreibzugriff auf die Ressource <b>{$FILE}</b> ist gescheitert. Möglicherweise ist die Ressource gerade durch einen anderen Nutzer zur Bearbeitung gesperrt, oder es sind unzureichende Rechte gesetzt oder die Ressource ist schreibgeschützt. Bitte informieren Sie den Webmaster dieser Seite.

# YanaCoreExceptionsFilesNotReadableException.h
source: Data could not be read
de: Daten konnten nicht gelesen werden

# YanaCoreExceptionsFilesNotReadableException.p
source: Unable to perform read operation on resource <b>{$FILE}</b>. Possible reason: access restriction in effect, or resource is not available. Please inform administrator on this error.
de: Der Zugriff auf die Ressource <b>{$FILE}</b> ist gescheitert. Möglicherweise ist die Ressource gerade durch einen anderen Nutzer zur Bearbeitung gesperrt, oder es sind unzureichende Rechte gesetzt oder die Ressource ist nicht verfügbar. Bitte informieren Sie den Webmaster dieser Seite.

# YanaCoreExceptionsMessagesFirstLoginMessage.h
source: Thank you for your registration.
de: Vielen Dank für Ihre Anmeldung.

# YanaCoreExceptionsMessagesFirstLoginMessage.p
source: Your password has been emailed to you! Please check your inbox!
de: Ihr Passwort wurde Ihnen gemailt! Bitte schauen Sie in Ihr Postfach!

# PluginsSearchIndexNotFoundException.h
source: Search index has not been found.
de: Suchindex nicht gefunden.

# PluginsSearchIndexNotFoundException.p
source: <b>Dear visitor:</b> the search engine is temporarily not available. Please inform the administrator of this site.<br /> <br /><b>Administrator:</b> Before using this search engine for the first time, you have to use the tool "suchindexErstellen" provided with this program to generate index-files for your web site. This index consists of 2 files: "keywords.dat" and "documents.dat" which need to placed in the directory: "plugins/search". For details on how to do this see the provided readme file!
de: <b>Sehr geehrter Besucher:</b> die Suchmaschine ist zur Zeit nicht verfügbar. Bitte wenden Sie sich an den Webmaster dieser Seite.<br /> <br /><b>Administrator:</b> Bevor Sie diese Suchmaschine das erste Mal benutzen müssen Sie mit dem beigelegten Tool "suchindexErstellen" einen Index für Ihre Webseite erstellen. Der Suchindex muss in den Dateien "keywords.dat" und "documents.dat" im Verzeichnis "plugins/search" gespeichert werden. Details dazu finden Sie in der Online-Hilfe!

# YanaDbMdb2PearDbException.h
source: PHP configuration error
de: Fehler in PHP-Konfiguration

# YanaDbMdb2PearDbException.p
source: This database application requires PEAR-MDB2. Since it could not be found on your server, this plugin was unable to start. <span class="embtag_tag_h">Administrators:</span Check the server configuration and make sure the variable "include_path" in file "php.ini" refers to the PEAR installation path.<span class="embtag_tag_h">Administrator:</span Inform your admin on this problem. In case you are not allowed to use PEAR-MDB2 on your server, I am afraid you won't be able to run database applications on this server.
de: Diese Datenbankanwendung benötigt PEAR-MDB2. Leider konnte diese auf Ihrem Server nicht gefunden werden. Deshalb konnte dieses Plugin nicht gestartet werden.<span class="embtag_tag_h">Administratoren:</span Überprüfen Sie die Serverkonfiguration und stellen Sie sicher, dass in der Datei "php.ini" der Installationspfad von PEAR in der Variable "include_path" genannt wird.<span class="embtag_tag_h">Administrator:</span Melden Sie dieses Problem Ihrem Administrator. Sollten Sie PEAR-MDB2 auf Ihrem Server nicht nutzen dürfen, müssen Sie auf die Datenbankunterstützung leider verzichten.

# YanaCoreExceptionsFormsSpamException.h
source: Access denied
de: Zugriff verweigert

# YanaCoreExceptionsFormsSpamException.p
source: To protect this site from spam, access to the requested resource was temporarily not granted to you.
de: Wegen Spam-Verdacht wurde Ihnen der Zugriff auf die gewünschte Ressource vorübergehend nicht gewährt.

# YanaCoreExceptionsFormsSuspendedException.h
source: Please be patient
de: Bitte haben Sie einen Moment Geduld

# YanaCoreExceptionsFormsSuspendedException.p
source: You did submit the form too recently. Please wait a few seconds and try again.
de: Sie haben das Formular zu schnell abgesendet. Bitte warten Sie einige Sekunden und versuchen Sie es erneut.

# YanaCoreExceptionsFormsInvalidTokenException.h
source: Incomplete form data
de: Formularangaben sind unvollständig

# YanaCoreExceptionsFormsInvalidTokenException.p
source: The form you submitted did not contain all mandatory data. Please reload and try again.
de: Das abgesendete Formular enthielt nicht alle Pflichtangaben. Bitte laden sie das Formular neu und versuchen Sie es noch einmal.

# YanaCoreExceptionsFormsTimeoutException.h
source: Form data has expired
de: Formulardaten sind abgelaufen

# YanaCoreExceptionsFormsTimeoutException.p
source: The data contained in the submitted form is more than half an hour old. Before you submit this entry, you should check if the provided data is still up to date.
de: Die Daten im Formular sind mehr als eine halbe Stunde alt. Bevor Sie den Eintrag abschicken, prüfen Sie bitte ob Ihre Daten noch aktuell sind.

# YanaCoreExceptionsMessagesMailMessage.h
source: E-mail sent
de: E-Mail gesendet

# YanaCoreExceptionsMessagesMailMessage.p
source: A message has been sent to the entered e-mail address. Please check your e-mail inbox.
de: Es wurde eine Nachricht an die angegebene Mailadresse gesendet. Bitte überprüfen Sie Ihr Mailpostfach.

# YanaCoreExceptionsUserMailInvalidException.h
source: Invalid e-mail address
de: Ungültige Mailadresse

# YanaCoreExceptionsUserMailInvalidException.p
source: Please check the entered e-mail address.
de: Überprüfen Sie bitte die von Ihnen angegebene Mailadresse.

# YanaCoreExceptionsUserMailNotFoundException.h
source: The entered e-mail address is not registered.
de: Die angegebene Mailadresse ist nicht registriert.

# YanaCoreExceptionsSecurityPasswordExpiredException.h
source: Permission denied
de: Zugriff verweigert

# YanaCoreExceptionsSecurityPasswordExpiredException.p
source: The time limit for changing your password has expired. Please re-request a new password. If you need assistance, contact your administrator for help.
de: Das Zeitlimit zum Ändern Ihres Passworts ist überschritten. Bitte fordern Sie erneut ein neues Passwort an. Falls Sie Unterstützung benötigen, wenden Sie sich bitte an Ihren Administrator.

# YanaCoreExceptionsFormsNothingSelectedException.h
source: Changes could not be saved
de: Änderungen konnten nicht gespeichert werden

# YanaCoreExceptionsFormsNothingSelectedException.p
source: Please select at least one entry for this operation.
de: Bitte wählen Sie für diese Operation mindestens einen Eintrag aus.

# YanaDbConnectionException.h
source: Unable to establish database connection.
de: Verbindung zur Datenbank konnte nicht hergestellt werden.

# YanaDbConnectionException.p
source: Check your connection settings and try again. If the settings are correct, the database may be unreachable at this time.
de: Prüfen Sie die Verbindungseinstellungen. Sollten die Einstellungen korrekt sein, so ist die Datenbank möglicherweise vorübergehend nicht erreichbar.

# Exception.h
source: The requested action could not be completed.
de: Es ist ein Fehler aufgetreten.

# Exception.p
source: Required files may have been removed or may not be accessable at the moment. Please check back later.<br />If you (even though) continue to get this message, please contact the administrator.
de: Die gewünschte Aktion konnte nicht ausgeführt werden. Bitte versuchen Sie es erneut.<br />Sollte der Fehler weiterhin auftreten, wenden Sie sich an den Webmaster.
