Repository: yanaFramework/yanaFramework
Catalog: trunk/languages/*/search.xlf
Languages: de

# program_title
source: search engine
de: Stichwortsuche

# search
source: search for:
de: Suche:

# stats_button
source: statistics
de: Statistik

# stats_title
source: click to see, what words other people are searching for
de: Liste der am Häufigsten gesuchten Begriffe

# related
source: related words to
de: verwandte Begriffe zu

# searchfor
source: searching for:
de: gesucht wurde nach:

# stats_name
source: statistics
de: Suchstatistiken

# stats_hits
source: hits
de: Zugriffe

# stats_hit
source: hit
de: Zugriff

# js_show
source: showing
de: Ansicht

# js_of
source: of
de: von

# js_results
source: search results
de: Suchergebnisse

# js_hits
source: hits
de: Treffer

# about
source: en/search/about.html
de: de/search/about.html

# whatsrelated
source: en/search/whatsrelated.html
de: de/search/whatsrelated.html

# stats_missing
source: <b>Dear visitor:</b> the statistics option is temporarily not available. Please inform the administrator of this site.<br /> <br /><b>Administrator:<b> Please make sure the script has writing access to the directory "{$COUNTERDIR}". This is needed in order to allow this script to store statistic information about your search engine.
de: <b>Sehr geehrter Besucher:</b> die Stastikfunktion ist zur Zeit nicht verfügbar. Bitte wenden Sie sich an den Webmaster dieser Seite.<br /> <br /><b>Administrator:<b> Achten Sie bitte darauf, dass dieses Skript für das Verzeichnis "{$COUNTERDIR}" Schreibrechte besitzen muss um eine Statistik anlegen zu können

# target_description
source: Name of the target frame, to open search results in.
de: Name des Frame, in welchem die Suchergebnisse angezeigt werden sollen.

# search_link
source: URL of this program
de: URL der Stichwortsuche

# prefix
source: Prefix for Links
de: Präfix für Links

# prefix_examples.0
source: will be inserted before the link, exp. http://www.domain.tld/path/ or pathA/pathB/pathC/
de: Wird vor den Link gesetzt, z.Bsp. http://www.domain.tld/pfad/ oder pfadA/pfadB/pfadC/

# prefix_examples.1
source: change this value, if you want to move this script to another directory or even another domain, but don't want to create new index files
de: ändern Sie diesen Wert, wenn Sie das Skript in ein anderes Verzeichnis oder auf eine andere Domain kopieren wollen, aber keinen neuen Suchindex erstellen wollen

# prefix_examples.2
source: all links will automatically be relocated to the URL specified by the prefix
de: alle Links werden automatisch zu der als Präfix angegebenen URL umgeleitet

# target_examples.0
source: _blank for "new window"
de: _blank für "neues Fenster"

# target_examples.1
source: _self for "current frame"
de: _self für "aktueller Frame"

# target_examples.2
source: _top for "current window"
de: _top für "aktuelles Fenster"

# upload.header
source: upload search index
de: offline erstellten Suchindex auf den Server kopieren

# upload.docs
source: document-index
de: Dokument-Index

# indexer.header
source: create search index online
de: Suchindex online erstellen

# indexer.dir
source: source directory
de: Quellverzeichnis

# indexer.recurse
source: recurse subdirectories
de: durchsuche Unterverzeichnisse

# indexer.meta
source: include meta tags
de: Metatags durchsuchen

# help.upload
source: If you created the search index offline with the included java tool, you may use this form to upload the generated files (documents.dat, keywords.dat). In case an old search index already exists, it will be replaced automatically.
de: Falls Sie den Suchindex für die Suchmaschine offline mit dem beigelegten Java-Tool erstellt haben, so können Sie die dabei generierten Dateien (documents.dat, keywords.dat) über dieses Formular auf dem Server speichern. Sollte bereits ein alter Suchindex existieren, so wird dieser automatisch ersetzt.

# help.dir
source: Provide the path to the directory, where the documents reside, which you want to index.
de: Geben Sie den Pfad zu dem Verzeichnis an, in welchem sich die zu durchsuchenden Dokumente befinden.

# help.recurse
source: Decide, whether subdirectories, inside the document directory, should be searched as well.
de: Geben Sie an, ob die Unterverzeichnisse des Quellverzeichnisses ebenfalls durchsucht werden sollen, oder nicht.

# help.meta
source: Decide, whether keywords, found in the meta tags of a document, should be included in the results, or not.
de: Geben Sie an, ob "Keywords", welche in den Metatags eines Dokuments gefunden werden, in die Suchergebnisse mit einbezogen werden sollen, oder nicht.

# help.index
source: You may use this form to create a search index now, using an included a indexer. Note: only files with the extensions html, htm, xml and shtml will be searched. Directories beginning with an underscore '_' will be ignored (you may use this to permanently prevent files from being indexed).
de: Sie können dieses Formular verwenden, um mit Hilfe des eingebauten Indexierungsprogramms jetzt einen Suchindex für Ihre Suchmaschine zu erstellen. Hinweis: nur Dateien mit den Endungen html, htm, xml und shtml werden durchsucht. Verzeichnisse, deren Name mit einem Unterstrich '_' beginnt, werden nicht durchsucht (Sie können dies nutzen, um bestimmte Dateien dauerhaft von der Suche auszuschliessen).
