Repository: yanaFramework/yanaFramework
Catalog: trunk/languages/*/user.xlf
Languages: de

# user.0
source: user administration
de: Nutzerverwaltung

# user.2
source: user overview
de: Nutzerübersicht

# user.3
source: edit user
de: Nutzer editieren

# user.4
source: enter login
de: Login eingeben

# user.5
source: old password
de: altes Passwort

# user.6
source: new password
de: neues Passwort

# user.6a
source: confirm password
de: Passwort bestätigen

# user.6b
source: password quality
de: Passwortsicherheit

# user.6c
source: The password shouldn't be easy to guess. Birthdates, names and words from dictionaries are not well suited. It should be at least 8 characters long and should contain at least 1 capital letter, 1 number and 1 special char. <br /> Good passwords need not to be difficult to remember. E.g.: "@n8moon&amp;*sshinebr8" (at night moon and stars shine bright) <br /> Also you may imagine a sentence and take the first letter of the words as the password. E.g.: "my Granny drives 1 red Harley at 100 Miles / Hour to London" as password "mGd1rHa100M/HtL"
de: Das Passwort sollte nicht leicht zu erraten sein. Geburtstage, Namen von Personen und alle Begriffe, die man in Duden oder Wörterbüchern findet, sind ungeeignet. Es sollte mehr als 8 Zeichen lang sein und mindestens 1 Großbuchstaben, 1 Zahl und 1 Sonderzeichen enthalten, jedoch möglichst nicht am Anfang oder Ende des Wortes. <br /> Dass man sich "gute Passwörter" so schlecht merken könne, ist nicht korrekt. Ein einfaches Beispiel: "n8sleuchtenMond&amp;*e" (nachts leuchten Mond und Sterne) <br /> Alternativ können Sie auch einen Satz überlegen, welcher leicht zu merken ist und die Anfangsbuchstaben der Worte als Passwort verwenden. Zum Beispiel: "meine Oma fährt 1 rote Harley mit 180 Km / Stunde nach Berlin" als Passwort "mOf1rHm180K/SnB"

# user.6d
source: Suggestions for secure passwords
de: Empfehlungen für sichere Passwörter

# user.7
source: Required: please insert your password here
de: Pflichtfeld: Geben Sie hier bitte Ihren Login an

# user.8
source: Required: please insert your password here
de: Pflichtfeld: Geben Sie hier bitte Ihr Passwort an

# user.9
source: after you entered your user name and password click here to log in
de: Nachdem Sie Ihren Nutzernamen und Passwort eingegeben haben, klicken Sie bitte hier um sich anzumelden.

# user.10
source: change password
de: Passwort ändern

# user.11
source: Please repeat your new password:
de: Bitte wiederholen Sie Ihr neues Passwort

# user.12
source: Password does match. Have a nice day!
de: Passwort ist korrekt. Vielen Dank!

# user.13
source: Password does not match. Please try again.
de: Passwort stimmt nicht überein. Bitte versuchen Sie es erneut.

# user.14
source: Password required
de: Passwort benötigt

# user.15
source: Password
de: Passwort

# user.17
source: more details on this person
de: Detailinformationen zu dieser Person

# user.18
source: create new user
de: Neuen Nutzer anlegen

# user.19
source: delete this entry
de: diesen Eintrag löschen

# user.20
source: edit this entry
de: diesen Eintrag editieren

# user.21
source: profiles
de: Profilverwaltung

# user.22
source: edit my profile
de: Mein Profil

# user.23
source: view this entry
de: diesen Eintrag anzeigen

# user.24
source: picture
de: mit Foto

# user.25
source: show user profiles
de: Nutzerprofile anzeigen

# user.26
source: register new user
de: neuen Nutzer anmelden

# user.27
source: Please enter your email address
de: Bitte geben Sie Ihre Mailadresse ein

# user.28
source: Please enter your prefered user name
de: Bitte geben Sie den gewünschten Nutzernamen ein

# user.29
source: user registration
de: Nutzeranmeldung

# user.30
source: visitors are allowed to create new accounts
de: Besucher dürfen sich selbstständig anmelden

# user.31
source: please click here to login
de: Bitte klicken Sie hier um sich einzuloggen

# user.32
source: user proxies
de: Stellvertretung für Nutzer

# user.33
source: user
de: Benutzer

# user.35
source: Forgotten your password?
de: Passwort vergessen?

# user.36
source: proxies
de: Stellvertretung

# user.37
source: calendar import for user
de: Kalender import für Nutzer

# user.38
source: current calendar files
de: Aktuelle Kalender dateien

# user.39
source: media database
de: Medien Datenbank

# user.40
source: press this button for download the ics file
de: Klicken Sie hier um die ics Datei herunterzuladen

# user.mail_subject
source: password for your account
de: Passwort für Ihren Account

# user.mail_body
source: Welcome {$NAME}!<br /> <br />We are sending you this mail, because someone set up a new password for your account.<br /> <br />Your new password is: {$PASSWORT}<br /> <br />Hope to see you soon!!!
de: Hallo {$NAME}!<br /> <br />Sie erhalten diese Mail weil ein neues Passwort für Ihren Account eingerichtet worden ist, mit dem Sie sich auf unserer Seite einloggen können.<br /> <br />Das Passwort lautet: {$PASSWORT}<br /> <br />Viel Spass!!!

# user.mail_lost_pwd_body
source: Hello,<br /> <br />You are recieving this mail becuase on {$TIME} someone used your e-mail address to request a new password for the account '{$NAME}'. If you didn't send this request, you just may ignore this mail.<br /> <br />If you wish to enter a new password now, please click the following link: {$WEBSITE}<br /> <br />If your e-mail application is not able to open it, please manually copy the link to your web-browser's address bar and hit the ENTER-key. The link is valid for 4 hours and will automatically be deactivated when time runs out.
de: Hallo,<br /> <br />Sie erhalten diese Mail weil am {$TIME} über Ihre Mailadresse ein neues Passwort für den Account '{$NAME}' angefordert wurde. Sollten Sie diese Anfrage NICHT selbst ausgelöst haben, können Sie diese Mail einfach ignorieren.<br /> <br />Falls Sie jetzt ein neues Passwort eingeben wollen, klicken Sie bitte auf folgenden Link: {$WEBSITE}<br /> <br />Sollte Ihr Mailprogramm den Link nicht öffnen können, kopieren Sie ihn manuell in die Adressleiste Ihres Webbrowsers und drücken Sie die ENTER-Taste. Der Link ist 4 Stunden gültig und wird nach Ablauf dieser Zeit automatisch deaktiviert.

# user.confirmation_mail
source: You get this mail because someone has registered on our web site {$SETTINGS.WEBSITE_URL} using your mail address {$MAIL}.<br /> <br />To confirm this registration, click on this link or copy'n'paste it to your browser's address field and hit (enter)<br />{$SETTINGS.WEBSITE_URL}?action=USER_AUTHENTIFICATION&target={$KEY}<br /> <br />If you didn't register for this service, you may ignore and delete this mail.<br />Please note that the above link is only active for 24 hours. If you don't confirm this registration in time, the account will be deleted automatically.<br />
de: Sie erhalten diese Mail, weil sich jemand mit dieser Mailadresse {$MAIL} auf unserer Webseite {$SETTINGS.WEBSITE_URL} angemeldet hat.<br /> <br />Um diese Anmeldung zu bestätigen, klicken Sie bitte auf diesen Link oder kopieren Sie die Adresse in das Adressfeld Ihres Webbrowser und drücken Sie (enter)<br />{$SETTINGS.WEBSITE_URL}?action=USER_AUTHENTIFICATION&target={$KEY}<br /> <br />Falls Sie sich nicht angemeldet haben, können Sie diese Mail ignorieren und löschen.<br />Beachten Sie bitte, dass der obige Link nur 24 Stunden aktiv bleibt. Falls die Anmeldung bis dahin nicht bestätigt wurde, wird der Account automatisch gelöscht.<br />

# user.authentication.title
source: authentication
de: Authentifizierung

# user.authentication.method
source: authentication method
de: Authentifizierungsmethode

# user.gender.m
source: male
de: männlich

# user.gender.f
source: female
de: weiblich

# user.gender.g
source: group of persons
de: Gruppe mehrerer Personen

# user.gender.o
source: other
de: divers

# user.option.0
source: user name
de: Nutzername

# user.option.1
source: user group
de: Nutzergruppe

# user.option.2
source: access
de: Zugriffsrechte

# user.option.3
source: user active
de: Nutzer aktiv

# user.option.5
source: contact (Mail)
de: Kontakt (Mail)

# user.option.6
source: picture
de: Foto

# user.option.7
source: {$USER.USER_ID} is registered as
de: {$USER.USER_ID} besitzt folgende Zugriffsrechte

# user.option.8
source: of profile ID
de: für das Profil

# user.option.9
source: lost password
de: Vergessenes Passwort

# user.option.10
source: Click here to generate a new password for this user.
de: Klicken Sie hier, um ein neues Passwort für diesen Nutzer zu generieren.

# user.option.11
source: <b><i>add a new entry</i></b>
de: <b><i>neuen Eintrag hinzufügen</i></b>

# user.option.12
source: remove entry
de: Eintrag entfernen

# user.option.13
source: chosen group
de: aktuelle Gruppe

# user.option.14
source: available groups
de: verfügbare Gruppen

# user.option.15
source: activate photo
de: Foto freischalten

# user.option.16
source: about me
de: über mich

# user.option.17
source: description
de: Beschreibung

# user.option.18
source: Picture not yet been approved!
de: Foto noch nicht freigegeben!

# user.option.19
source: gender
de: Geschlecht

# user.option.20
source: {$USER.USER_ID} is {lang id="USER.GENDER.M"}
de: {$USER.USER_ID} ist {lang id="USER.GENDER.M"}

# user.option.21
source: {$USER.USER_ID} is {lang id="USER.GENDER.F"}
de: {$USER.USER_ID} ist {lang id="USER.GENDER.F"}

# user.option.22
source: {$USER.USER_ID} is a {lang id="USER.GENDER.G"}
de: {$USER.USER_ID} ist eine {lang id="USER.GENDER.G"}

# user.option.23
source: security level
de: Sicherheitsstufe

# user.option.24
source: user role
de: Nutzerrolle

# user.option.25
source: edit user roles
de: Nutzerrollen editieren

# user.option.26
source: edit user groups
de: Nutzergruppen editieren

# user.option.27
source: assign
de: zuordnen

# user.option.28
source: access granted by
de: Zugriff erteilt durch

# user.option.29
source: profile
de: Profil

# user.option.30
source: select all
de: alle auswählen

# user.option.31
source: Status information about assigned rights
de: Statusinformationen über zugewiesene Rechte

# user.option.32
source: Groups and Roles assign
de: Gruppen und Rollen zuordnen

# user.option.33
source: function
de: Funktion

# user.option.34
source: Rule actively
de: Regel aktiv

# user.option.35
source: predefined
de: vordefiniert

# user.option.36
source: password quality - setup
de: Passwortqualität - Setup

# user.option.37
source: minimum quality in percent
de: Mindestqualität in Prozent

# user.option.38
source: number of saved passwords
de: Anzahl der gespeicherten Passwörter

# user.option.39
source: password expire time
de: Passwörter laufen ab

# user.option.40
source: never
de: nie

# user.option.41
source: 1 month
de: 1 Monat

# user.option.42
source: 3 months
de: 3 Monat

# user.option.43
source: 6 months
de: 6 Monat

# user.option.44
source: 1 year
de: 1 Jahr

# user.profil.0
source: 's profile
de: 's Profil

# user.profil.1
source: was registered
de: angemeldet seit

# user.profil.1a
source: and has been online {$USER.COUNT_LOGINS} times
de: und war {$USER.COUNT_LOGINS}x online

# user.profil.2
source: last login
de: letzter Login

# user.profil.3
source: this profile has been modified on:
de: dieses Profil wurde zuletzt aktualisiert am:

# user.profil.4
source: {$USER.COUNT_ARTICLES} written articles
de: {$USER.COUNT_ARTICLES} verfasste Beiträge bisher

# user.calendar.name
source: calendar name
de: Kalender name

# user.calendar.file
source: filename
de: Dateiname

# descr_user_edit
source: Here you may edit {$USERNAME}'s profile.
de: Hier können Sie das Profil des Nutzers {$USERNAME} editieren.

# descr_user_configuration
source: This page offers an overview of all registered users.
de: Auf dieser Seite finden Sie eine Übersicht über alle angemeldeten Nutzer.

# help.user
source: By using the option "active" you may block an user account temporarily, if needed.
de: Über die Option "aktiv" können Sie ein Nutzerkonto sperren, falls erforderlich.

# help.profile
source: Click on the symbol in column "{lang id="USER.OPTION.0"}", to view the user's profile.
de: Klicken Sie auf das Symbol in der Spalte "{lang id="USER.OPTION.0"}", um das Profil des Nutzer anzeigen zu lassen.

# help.access
source: Click on the symbol in column "{lang id="USER.OPTION.1"}", to set advanced login rules for this user.
de: Klicken Sie auf das Symbol in der Spalte "{lang id="USER.OPTION.1"}", um erweiterte Zugriffsrechte für diesen Nutzer festzulegen.

# help.new
source: For new users the password is created automatically and will be send to the mail address you provided. Please make sure, the mail address is correct.
de: Für neue Nutzer wird das Passwort automatisch erzeugt und an die angegebene Mailadresse versandt. Achten Sie daher bitte darauf, dass die Mailadresse korrekt ist.

# help.user_group
source: The user group setting tells the status this user is granted in general. This setting works as a default for all profiles.
de: Die Nutzergruppe legt fest, welchen Status der Nutzer normalerweise geniesst. Diese Einstellung gilt für alle existierenden Profile.

# help.chg_rules
source: If you want to set up separate rules for certain profiles, after creating a user click on "{lang id="USER.OPTION.2"}" at main administration menu to change local access rules.
de: Falls Sie für einzelne Profile andere Einstellungen vornehmen wollen, klicken Sie nachdem Sie den Nutzer angelegt haben im Admin-Menü auf "{lang id="USER.OPTION.2"}" und ändern Sie die lokalen Zugriffsrechte.

# help.access_rules
source: Local access rules are only used for the guestbook that matches the given ID. You may use this to express, that a user acts as a member of a specific user group when accessing a certain profile. You may use this to (for example) grant an user moderator status.
de: Lokale Zugriffsrechte gelten nur für das Profil mit der angegebenen Profil-ID. Sie legen damit fest, dass ein Nutzer beim Zugriff auf ein bestimmtes Profil als Mitglied einer anderen Nutzergruppe agiert. Sie können zum Beispiel verwendet werden, um einem Profil Besitzer oder Moderatoren zuzuordnen.

# help.mail
source: Registration requires a working email address, to which your password may be emailed to. So please make sure your mail address is always up to date.<br /> <br /> It will only be used to manage your account and of course we <i>will not</i> move your data on to any third party. You <i>will not</i> get any automatic newsletter and your address <i>will not</i> be shown on our web site.
de: Um sich Anmelden zu können benötigen Sie eine funktionierende Mailadresse, an welche Ihr persönliches Passwort gesendet werden kann. Achten Sie daher bitte darauf, dass Ihre Adresse korrekt und stets aktuell ist.<br /> <br /> Ihre Mailadresse wird nur zur Verwaltung Ihres Nutzerkontos verwendet und selbstverständlich <i>nicht</i> an Dritte weitergegeben. Sie erhalten durch die Eingabe Ihrer Mailadresse <i>keinen</i> automatischen Newsletter von uns und Ihre Adresse wird auch <i>nicht</i> auf unserer Webseite angezeigt.

# help.password
source: Please note, that your user name may only consist of letter (a-z), numbers (0-9), as well as underscores or hyphens (_-). Whitespace and special characters are not allowed. It is not case sensitive.
de: Achten Sie darauf, dass bei Ihrem Nutzernamen lediglich Buchstaben (a-z), Zahlen (0-9), sowie Unter- oder Bindestriche (_-) verwendet werden dürfen. Leer- und Sonderzeichen sind nicht erlaubt. Groß- und Kleinschreibung sind unwichtig.

# help.grants_user
source: Via this option you may grant your security privileges to other users.
de: Über diese Option ist es Ihnen möglich Zugriffsrechte an andere Nutzer weiterzugeben.

# help.grants_info
source: By checking the checkboxes you may choose the groups, roles and security-levels you want to grant to the user. Or just click "select all", if you wish to grant all privileges.
de: Durch markieren der Checkboxen können Sie Gruppen, Rollen und Sicherheitsstufen auswählen, welche Sie dem Nutzer gewähren möchte. Klicken Sie auf "alle auswählen", falls Sie alle Rechte weitergeben möchten.

# help.grants_execute
source: Select the user and confirm your choice by clicking "assign".
de: Wählen Sie den Benutzer aus bestätigen Sie mit Klick auf "zuordnen".

# help.grants_remove_user
source: Here is a list of users that you previously granted security privileges.
de: Hier finden Sie eine Liste aller Nutzer, welche von Ihnen Zugriffsrechte erhalten haben.

# help.grants_remove_expert
source: The list shows the groups, roles and security levels you gave to the user. Mark the entries you wish to remove, or click "select all" to removes all the existing entries.
de: Sie finden in der Liste die Namen der Gruppen, Rollen und Sicherheitsstufen, welche der jeweilige Nutzer durch Sie erhalten hat. Markieren Sie die Einträge, welche Sie wieder entfernen wollen, oder klicken Sie auf "alle auswählen" um sämtliche bestehenden Einträge zu löschen.

# help.grants_remove_non_expert
source: To remove privileges you previously gave, select the corresponding user and confirm your choice by clicking "remove".
de: Um zuvor gewährte Rechte zu entfernen, wählen Sie den betreffenden Nutzer und bestätigen Sie durch Klick auf "entfernen".

# help.action_settings
source: Via this option you can set grant your security privileges to a function. Note that the new defined function can only by used by users which have the expected rules that you set.
de: Über diese Option ist es Ihnen möglich Zugriffsrechte für eine Funktion zu vergeben. Beachten Sie das die erstellte Funktion nur von den Usern benutzt werden kann die auch die entsprechenden Zugangs Berechtigungen haben.

# help.action_settings_execute
source: Choose a group, role, level and matching function to them this rule is supposed to count you store with "submit".
de: Wählen Sie eine Gruppe, Rolle, Level und die dazugehörige funktion für die diese Regel gelten soll speichern Sie mit "Abschicken".

# help.password_quality
source: This options set the password quality requirements. You can choose the minimum password quality and a time duration for a password. Additionally you can choose the number of allready used passwords, too check it and make sure that the new one is not the same like the last x-passwords.
de: Über diese Optionen können Sie die Passwort-Qualitätsvoraussetzungen setzen. Sie können die minimale Qualität und eine Zeitdauer für ein Passwort wählen. Zusätzlich können Sie die Anzahl der bereits verwendeten Passwörter festlegen, und prüfen ob das aktuelle Passwort sich von den letzten x-Passwörtern unterscheidet.

# help.media_head
source: This Option has enebeled the upload for new image files.
de: Über diese Option ist es Ihnen möglich Bilder hochzuladen.

# help.media_footer
source: For change the image into active mode you need only too set the current checkbox.
de: Durch markieren der Checkboxen können Sie die Bilder auf aktiv setzen, bzw. freischalten für die nutzung der Bilder.

# help.new_media_head
source: This Option has enebeled the view mode for overview current images.
de: Über diese Option ist es Ihnen möglich vorhandene Bilder anzusehen.

# help.new_calendar_head
source: Use this Option for load the *.ical calendar file into the system.
de: Über diese option ist es Ihnen möglich die *.ical Kalender Datei in das System zu integrieren.

# help.new_calendar_description
source: Please choose the *.ical calendar file from your PC which you want to import:
de: Wählen Sie die *.ical Kalender Datei von Ihrem Rechner aus welche Sie importieren möchten:

# help.view_calendar_head
source: This Option is used for export your calendar file into the *.ical file format. For this action you need to press the download icon. Additionally you can remove your own calendar files from the system
de: Über diese option ist es Ihnen möglich vorhandene Kalender in das *.ical format zu exportieren. Hierzu muss der download Button betätigt werden der diese action auslöst. Ausserdem haben Sie die möglichkeit vorhandene Kalender aus dem system zu löschen.
